sorosaulong-ux/gd32-test-project/Library/gd32a7xx_spi.h
/*!
    \file    gd32a7xx_spi.h
    \brief   definitions for the SPI

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_SPI_H
#define GD32A7XX_SPI_H
#include "gd32a7xx.h"

/* SPIx(x=0,1,2,3,4,5,6,7) definitions */
#define SPI0                           (SPI_BASE + 0x0000F800U)               /*!< SPI0 base adress */
#define SPI1                           (SPI_BASE + 0x00014000U)               /*!< SPI1 base adress */
#define SPI2                           (SPI_BASE + 0x0000AC00U)               /*!< SPI2 base adress */
#define SPI3                           (SPI_BASE + 0x0000B000U)               /*!< SPI3 base adress */
#define SPI4                           (SPI_BASE + 0x00010C00U)               /*!< SPI4 base adress */
#define SPI5                           (SPI_BASE + 0x00011000U)               /*!< SPI5 base adress */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define SPI6                            SPI_BASE                              /*!< SPI6 base adress */
#define SPI7                           (SPI_BASE + 0x00000400U)               /*!< SPI7 base adress */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* I2Sx(x=4,5,6,7) definitions */
#define I2S4                           SPI4                                   /*!< I2S4 base adress */
#define I2S5                           SPI5                                   /*!< I2S5 base adress */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define I2S6                           SPI6                                   /*!< I2S6 base adress */
#define I2S7                           SPI7                                   /*!< I2S7 base adress */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */


/* registers definitions */
#define SPI_CTL0(spix)                  REG32((spix) + 0x00000000U)             /*!< SPI control register 0 */
#define SPI_CTL1(spix)                  REG32((spix) + 0x00000004U)             /*!< SPI control register 1*/
#define SPI_STAT(spix)                  REG32((spix) + 0x00000008U)             /*!< SPI status register */
#define SPI_DATA(spix)                  REG32((spix) + 0x0000000CU)             /*!< SPI data register */
#define SPI_CRCPOLY(spix)               REG32((spix) + 0x00000010U)             /*!< SPI CRC polynomial register */
#define SPI_TCRC(spix)                  REG32((spix) + 0x00000018U)             /*!< SPI transmit CRC register */
#define SPI_I2SCTL(spix)                REG32((spix) + 0x0000001CU)             /*!< SPI I2S control register */
#define SPI_I2SPSC(spix)                REG32((spix) + 0x00000020U)             /*!< SPI I2S clock prescaler register */
#define SPI_MREQCFG(spix)               REG32((spix) + 0x00000028U)             /*!< SPI HREQ configuration register */
#define SPI_CKCFG0(spix)                REG32((spix) + 0x0000002CU)             /*!< SPI clock configuration register 0 */
#define SPI_CKCFG1(spix)                REG32((spix) + 0x00000030U)             /*!< SPI clock configuration register 1 */
#define SPI_CCTL(spix)                  REG32((spix) + 0x00000034U)             /*!< SPI continuous control register */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define SPI_POLCTL(spix)                REG32((spix) + 0x00000038U)             /*!< SPI NSS polarity control register */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define SPI_QCTL(spix)                  REG32((spix) + 0x00000080U)             /*!< SPI quad mode control register(only SPI0 and SPI2) */

/* bits definitions */
/* SPI_CTL0 */
#define SPI_CTL0_CKPH                   BIT(0)                                  /*!< clock phase selection*/
#define SPI_CTL0_CKPL                   BIT(1)                                  /*!< clock polarity selection */
#define SPI_CTL0_MSTMOD                 BIT(2)                                  /*!< master mode enable */
#define SPI_CTL0_SPIEN                  BIT(6)                                  /*!< SPI enable*/
#define SPI_CTL0_LF                     BIT(7)                                  /*!< LSB first mode */
#define SPI_CTL0_SWNSS                  BIT(8)                                  /*!< NSS pin selection in NSS software mode */
#define SPI_CTL0_SWNSSEN                BIT(9)                                  /*!< NSS software mode selection */
#define SPI_CTL0_RO                     BIT(10)                                 /*!< receive only */
#define SPI_CTL0_CRCNT                  BIT(12)                                 /*!< CRC next transfer */
#define SPI_CTL0_CRCEN                  BIT(13)                                 /*!< CRC calculation enable */
#define SPI_CTL0_BDOEN                  BIT(14)                                 /*!< bidirectional transmit output enable*/
#define SPI_CTL0_BDEN                   BIT(15)                                 /*!< bidirectional enable */
#define SPI_CTL0_PSC                    BITS(16,22)                              /*!< master clock prescaler selection */

/* SPI_CTL1 */
#define SPI_CTL1_DMAREN                 BIT(0)                                  /*!< receive buffer DMA enable */
#define SPI_CTL1_DMATEN                 BIT(1)                                  /*!< transmit buffer DMA enable */
#define SPI_CTL1_NSSDRV                 BIT(2)                                  /*!< drive NSS output */
#define SPI_CTL1_NSSP                   BIT(3)                                  /*!< SPI NSS pulse mode enable */
#define SPI_CTL1_TMOD                   BIT(4)                                  /*!< SPI TI mode enable */
#define SPI_CTL1_ERRIE                  BIT(5)                                  /*!< errors interrupt enable */
#define SPI_CTL1_RFDRIE                 BIT(6)                                  /*!< receive fifo data ready interrupt enable */
#define SPI_CTL1_TFAIE                  BIT(7)                                  /*!< transmit fifo available interrupt enable */
#define SPI_CTL1_DZ                     BITS(8,12)                              /*!< data size for transfer (memory size) */
#define SPI_CTL1_NSSPOL                 BIT(15)                                /*!< NSS polarity */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define SPI_CTL1_NSSSEL                 BITS(17,19)                             /*!< SPI NSS select */
#else
#define SPI_CTL1_NSSSEL                 BITS(17,18)                             /*!< SPI NSS select */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define SPI_CTL1_FIFOLBEN               BIT(20)                                 /*!< fifo loopback mode enable */
#define SPI_CTL1_SINGMOD                BIT(21)                                 /*!< single-frame mode enable */
#define SPI_CTL1_TOEN                   BIT(22)                                 /*!< timeout enable */
#define SPI_CTL1_TOIE                   BIT(23)                                 /*!< timeout interrupt enable */
#define SPI_CTL1_TOCFG                  BITS(24,31)                             /*!< timeout configuration */

/* SPI_STAT */
#define SPI_STAT_RFDR                   BIT(0)                                  /*!< reception fifo data ready */
#define SPI_STAT_TFA                    BIT(1)                                  /*!< transmission fifo available */
#define SPI_STAT_I2SCH                  BIT(2)                                  /*!< I2S channel side */
#define SPI_STAT_TXURERR                BIT(3)                                  /*!< I2S transmission underrun error bit */
#define SPI_STAT_CONFERR                BIT(5)                                  /*!< SPI configuration error bit */
#define SPI_STAT_RXORERR                BIT(6)                                  /*!< SPI reception overrun error bit */
#define SPI_STAT_TRANS                  BIT(7)                                  /*!< transmitting on-going bit */
#define SPI_STAT_FERR                   BIT(8)                                  /*!< format error bit */
#define SPI_STAT_RXLVL                  BITS(9,12)                              /*!< refer to the current storage of the rxfifo */
#define SPI_STAT_TXLVL                  BITS(14,17)                             /*!< refer to the current storage of the txfifo */
#define SPI_STAT_TOF                    BIT(19)                                 /*!< SPI idle timeout flag */

/* SPI_I2SCTL */
#define SPI_I2SCTL_CHLEN                BIT(0)                                  /*!< channel length */
#define SPI_I2SCTL_DTLEN                BITS(1,2)                               /*!< data length */
#define SPI_I2SCTL_CKPL                 BIT(3)                                  /*!< idle state clock polarity */
#define SPI_I2SCTL_I2SSTD               BITS(4,5)                               /*!< I2S standard selection */
#define SPI_I2SCTL_PCMSMOD              BIT(7)                                  /*!< PCM frame synchronization mode */
#define SPI_I2SCTL_I2SOPMOD             BITS(8,9)                               /*!< I2S operation mode */
#define SPI_I2SCTL_I2SEN                BIT(10)                                 /*!< I2S enable */
#define SPI_I2SCTL_I2SSEL               BIT(11)                                 /*!< I2S mode selection */

/* SPI_I2SPSC */
#define SPI_I2SPSC_DIV                  BITS(0,7)                               /*!< dividing factor for the prescaler */
#define SPI_I2SPSC_OF                   BIT(8)                                  /*!< odd factor for the prescaler */
#define SPI_I2SPSC_MCKOEN               BIT(9)                                  /*!< I2S MCK output enable */

/* SPI_MREQCFG */
#define SPI_MREQCFG_MREQEN              BIT(0)                                  /*!< host request enable */
#define SPI_MREQCFG_MREQPL              BIT(1)                                  /*!< host request polarity */
#define SPI_MREQCFG_MREQSEL             BIT(2)                                  /*!< host request select */
#define SPI_MREQCFG_MREQDIR             BIT(3)                                  /*!< configure the direction of SPI_HREQ pin */

/* SPI_CKCFG0 */
#define SPI_CKCFG0_NSSSCK               BITS(0,7)                               /*!< minimum delay from NSS active to SCK active */
#define SPI_CKCFG0_SCKNSS               BITS(8,15)                              /*!< minimum delay from SCK inactive to NSS inactive */
#define SPI_CKCFG0_NSSNSS               BITS(16,23)                             /*!< minimum delay from NSS inactive to NSS active */

/* SPI_CKCFG1 */
#define SPI_CKCFG1_SAMPDLY              BITS(0,11)                              /*!< master receive data sampling delay */
#define SPI_CKCFG1_SAMPDLYEN            BIT(12)                                 /*!< master receive data sampling delay enabled */

