sorosaulong-ux/gd32-test-project/Library/gd32a7xx_spi.h
/* SPI_CCTL */
#define SPI_CCTL_FRAMLEN                BITS(0,15)                              /*!< continuous transmission frame count */
#define SPI_CCTL_HCEN                   BIT(16)                                 /*!< hardware continuous frame mode enable */

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* SPI_POLCTL */
#define SPI_POLCTL_NSSPOLS              BITS(0,7)                               /*!< polarity of each NSS pin */
#define SPI_POLCTL_NSSPOLMOD            BIT(8)                                  /*!< NSS polarity mode selection */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* SPI_QCTL(only available in SPI0/2) */
#define SPI_QCTL_QMOD                   BIT(0)                                  /*!< quad-SPI mode enable */
#define SPI_QCTL_QRD                    BIT(1)                                  /*!< quad-SPI mode read select */

/* constants definitions */
/* SPI and I2S parameter struct definitions */
typedef struct {
    uint32_t device_mode;                                                       /*!< SPI master or slave */
    uint32_t trans_mode;                                                        /*!< SPI transtype */
    uint32_t nss;                                                               /*!< SPI NSS control by handware or software */
    uint32_t nss_polarity;                                                      /*!< SPI NSS polarity */
    uint32_t endian;                                                            /*!< SPI big endian or little endian */
    uint32_t clock_polarity_phase;                                              /*!< SPI clock phase and polarity */
    uint32_t prescale;                                                          /*!< SPI prescale factor */
} spi_parameter_struct;

/* SPI mode definitions */
#define SPI_MASTER                      (SPI_CTL0_MSTMOD | SPI_CTL0_SWNSS)      /*!< SPI as master */
#define SPI_SLAVE                       ((uint32_t)0x00000000U)                 /*!< SPI as slave */

/* SPI bidirectional transfer direction */
#define SPI_BIDIRECTIONAL_TRANSMIT      SPI_CTL0_BDOEN                          /*!< SPI work in transmit-only mode */
#define SPI_BIDIRECTIONAL_RECEIVE       (~SPI_CTL0_BDOEN)                       /*!< SPI work in receive-only mode */

/* SPI transmit type */
#define SPI_TRANSMODE_FULLDUPLEX        ((uint32_t)0x00000000U)                 /*!< SPI receive and send data at fullduplex communication */
#define SPI_TRANSMODE_RECEIVEONLY       SPI_CTL0_RO                             /*!< SPI only receive data */
#define SPI_TRANSMODE_BDRECEIVE         SPI_CTL0_BDEN                           /*!< bidirectional receive data */
#define SPI_TRANSMODE_BDTRANSMIT        (SPI_CTL0_BDEN | SPI_CTL0_BDOEN)        /*!< bidirectional transmit data*/

/* SPI NSS control mode */
#define SPI_NSSSEL(regval)              (BITS(17,19) & ((uint32_t)(regval) << 17U))
#define SPI_NSS_SOFT                    SPI_CTL0_SWNSSEN                        /*!< SPI NSS control by software */
#define SPI_NSS_HARD                    ((uint32_t)0x00000000U)                 /*!< SPI NSS control by hardware */

/* SPI NSS polarity */
#define SPI_NSS_POLARITY_LOW            ((uint32_t)0x00000000U)                 /*!< SPI NSS polarity is low */
#define SPI_NSS_POLARITY_HIGH           SPI_CTL1_NSSPOL                         /*!< SPI NSS polarity is high */

/* SPI transmit way */
#define SPI_ENDIAN_MSB                  ((uint32_t)0x00000000U)                 /*!< SPI transmit way is big endian: transmit MSB first */
#define SPI_ENDIAN_LSB                  SPI_CTL0_LF                             /*!< SPI transmit way is little endian: transmit LSB first */

/* SPI clock phase and polarity */
#define SPI_CK_PL_LOW_PH_1EDGE          ((uint32_t)0x00000000U)                 /*!< SPI clock polarity is low level and phase is first edge */
#define SPI_CK_PL_HIGH_PH_1EDGE         SPI_CTL0_CKPL                           /*!< SPI clock polarity is high level and phase is first edge */
#define SPI_CK_PL_LOW_PH_2EDGE          SPI_CTL0_CKPH                           /*!< SPI clock polarity is low level and phase is second edge */
#define SPI_CK_PL_HIGH_PH_2EDGE         (SPI_CTL0_CKPL | SPI_CTL0_CKPH)         /*!< SPI clock polarity is high level and phase is second edge */

/* SPI clock prescaler factor */
#define SPI_PSC_2                       ((uint32_t)0x00000000U)                 /*!< SPI clock prescaler factor is 2 */
#define SPI_PSC_4                       ((uint32_t)0x00000001U)                 /*!< SPI clock prescaler factor is 4 */
#define SPI_PSC_6                       ((uint32_t)0x00000002U)                 /*!< SPI clock prescaler factor is 6 */
#define SPI_PSC_8                       ((uint32_t)0x00000003U)                 /*!< SPI clock prescaler factor is 8 */
#define SPI_PSC_10                      ((uint32_t)0x00000004U)                 /*!< SPI clock prescaler factor is 10 */
#define SPI_PSC_12                      ((uint32_t)0x00000005U)                 /*!< SPI clock prescaler factor is 12 */
#define SPI_PSC_14                      ((uint32_t)0x00000006U)                 /*!< SPI clock prescaler factor is 14 */
#define SPI_PSC_16                      ((uint32_t)0x00000007U)                 /*!< SPI clock prescaler factor is 16 */
#define SPI_PSC_18                      ((uint32_t)0x00000008U)                 /*!< SPI clock prescaler factor is 18 */
#define SPI_PSC_20                      ((uint32_t)0x00000009U)                 /*!< SPI clock prescaler factor is 20 */
#define SPI_PSC_22                      ((uint32_t)0x0000000AU)                 /*!< SPI clock prescaler factor is 22 */
#define SPI_PSC_24                      ((uint32_t)0x0000000BU)                 /*!< SPI clock prescaler factor is 24 */
#define SPI_PSC_26                      ((uint32_t)0x0000000CU)                 /*!< SPI clock prescaler factor is 26 */
#define SPI_PSC_28                      ((uint32_t)0x0000000DU)                 /*!< SPI clock prescaler factor is 28 */
#define SPI_PSC_30                      ((uint32_t)0x0000000EU)                 /*!< SPI clock prescaler factor is 30 */
#define SPI_PSC_32                      ((uint32_t)0x0000000FU)                 /*!< SPI clock prescaler factor is 32 */
#define SPI_PSC_34                      ((uint32_t)0x00000010U)                 /*!< SPI clock prescaler factor is 34 */
#define SPI_PSC_36                      ((uint32_t)0x00000011U)                 /*!< SPI clock prescaler factor is 36 */
#define SPI_PSC_38                      ((uint32_t)0x00000012U)                 /*!< SPI clock prescaler factor is 38 */
#define SPI_PSC_40                      ((uint32_t)0x00000013U)                 /*!< SPI clock prescaler factor is 40 */
#define SPI_PSC_42                      ((uint32_t)0x00000014U)                 /*!< SPI clock prescaler factor is 42 */
#define SPI_PSC_44                      ((uint32_t)0x00000015U)                 /*!< SPI clock prescaler factor is 44 */
#define SPI_PSC_46                      ((uint32_t)0x00000016U)                 /*!< SPI clock prescaler factor is 46 */
#define SPI_PSC_48                      ((uint32_t)0x00000017U)                 /*!< SPI clock prescaler factor is 48 */
#define SPI_PSC_50                      ((uint32_t)0x00000018U)                 /*!< SPI clock prescaler factor is 50 */
#define SPI_PSC_52                      ((uint32_t)0x00000019U)                 /*!< SPI clock prescaler factor is 52 */
#define SPI_PSC_54                      ((uint32_t)0x0000001AU)                 /*!< SPI clock prescaler factor is 54 */
#define SPI_PSC_56                      ((uint32_t)0x0000001BU)                 /*!< SPI clock prescaler factor is 56 */
#define SPI_PSC_58                      ((uint32_t)0x0000001CU)                 /*!< SPI clock prescaler factor is 58 */
#define SPI_PSC_60                      ((uint32_t)0x0000001DU)                 /*!< SPI clock prescaler factor is 60 */
#define SPI_PSC_62                      ((uint32_t)0x0000001EU)                 /*!< SPI clock prescaler factor is 62 */
#define SPI_PSC_64                      ((uint32_t)0x0000001FU)                 /*!< SPI clock prescaler factor is 64 */
#define SPI_PSC_66                      ((uint32_t)0x00000020U)                 /*!< SPI clock prescaler factor is 66 */
#define SPI_PSC_68                      ((uint32_t)0x00000021U)                 /*!< SPI clock prescaler factor is 68 */
#define SPI_PSC_70                      ((uint32_t)0x00000022U)                 /*!< SPI clock prescaler factor is 70 */
#define SPI_PSC_72                      ((uint32_t)0x00000023U)                 /*!< SPI clock prescaler factor is 72 */
#define SPI_PSC_74                      ((uint32_t)0x00000024U)                 /*!< SPI clock prescaler factor is 74 */
#define SPI_PSC_76                      ((uint32_t)0x00000025U)                 /*!< SPI clock prescaler factor is 76 */
#define SPI_PSC_78                      ((uint32_t)0x00000026U)                 /*!< SPI clock prescaler factor is 78 */
#define SPI_PSC_80                      ((uint32_t)0x00000027U)                 /*!< SPI clock prescaler factor is 80 */
#define SPI_PSC_82                      ((uint32_t)0x00000028U)                 /*!< SPI clock prescaler factor is 82 */
#define SPI_PSC_84                      ((uint32_t)0x00000029U)                 /*!< SPI clock prescaler factor is 84 */
#define SPI_PSC_86                      ((uint32_t)0x0000002AU)                 /*!< SPI clock prescaler factor is 86 */
#define SPI_PSC_88                      ((uint32_t)0x0000002BU)                 /*!< SPI clock prescaler factor is 88 */
#define SPI_PSC_90                      ((uint32_t)0x0000002CU)                 /*!< SPI clock prescaler factor is 90 */
#define SPI_PSC_92                      ((uint32_t)0x0000002DU)                 /*!< SPI clock prescaler factor is 92 */
#define SPI_PSC_94                      ((uint32_t)0x0000002EU)                 /*!< SPI clock prescaler factor is 94 */
#define SPI_PSC_96                      ((uint32_t)0x0000002FU)                 /*!< SPI clock prescaler factor is 96 */
#define SPI_PSC_98                      ((uint32_t)0x00000030U)                 /*!< SPI clock prescaler factor is 98 */
#define SPI_PSC_100                     ((uint32_t)0x00000031U)                 /*!< SPI clock prescaler factor is 100 */
#define SPI_PSC_102                     ((uint32_t)0x00000032U)                 /*!< SPI clock prescaler factor is 102 */
#define SPI_PSC_104                     ((uint32_t)0x00000033U)                 /*!< SPI clock prescaler factor is 104 */
#define SPI_PSC_106                     ((uint32_t)0x00000034U)                 /*!< SPI clock prescaler factor is 106 */
#define SPI_PSC_108                     ((uint32_t)0x00000035U)                 /*!< SPI clock prescaler factor is 108 */
#define SPI_PSC_110                     ((uint32_t)0x00000036U)                 /*!< SPI clock prescaler factor is 110 */
#define SPI_PSC_112                     ((uint32_t)0x00000037U)                 /*!< SPI clock prescaler factor is 112 */
#define SPI_PSC_114                     ((uint32_t)0x00000038U)                 /*!< SPI clock prescaler factor is 114 */
#define SPI_PSC_116                     ((uint32_t)0x00000039U)                 /*!< SPI clock prescaler factor is 116 */
#define SPI_PSC_118                     ((uint32_t)0x0000003AU)                 /*!< SPI clock prescaler factor is 118 */
#define SPI_PSC_120                     ((uint32_t)0x0000003BU)                 /*!< SPI clock prescaler factor is 120 */
#define SPI_PSC_122                     ((uint32_t)0x0000003CU)                 /*!< SPI clock prescaler factor is 122 */
#define SPI_PSC_124                     ((uint32_t)0x0000003DU)                 /*!< SPI clock prescaler factor is 124 */
#define SPI_PSC_126                     ((uint32_t)0x0000003EU)                 /*!< SPI clock prescaler factor is 126 */
#define SPI_PSC_128                     ((uint32_t)0x0000003FU)                 /*!< SPI clock prescaler factor is 128 */
#define SPI_PSC_130                     ((uint32_t)0x00000040U)                 /*!< SPI clock prescaler factor is 130 */
#define SPI_PSC_132                     ((uint32_t)0x00000041U)                 /*!< SPI clock prescaler factor is 132 */
#define SPI_PSC_134                     ((uint32_t)0x00000042U)                 /*!< SPI clock prescaler factor is 134 */
#define SPI_PSC_136                     ((uint32_t)0x00000043U)                 /*!< SPI clock prescaler factor is 136 */
#define SPI_PSC_138                     ((uint32_t)0x00000044U)                 /*!< SPI clock prescaler factor is 138 */
#define SPI_PSC_140                     ((uint32_t)0x00000045U)                 /*!< SPI clock prescaler factor is 140 */
#define SPI_PSC_142                     ((uint32_t)0x00000046U)                 /*!< SPI clock prescaler factor is 142 */
#define SPI_PSC_144                     ((uint32_t)0x00000047U)                 /*!< SPI clock prescaler factor is 144 */
#define SPI_PSC_146                     ((uint32_t)0x00000048U)                 /*!< SPI clock prescaler factor is 146 */
#define SPI_PSC_148                     ((uint32_t)0x00000049U)                 /*!< SPI clock prescaler factor is 148 */
#define SPI_PSC_150                     ((uint32_t)0x0000004AU)                 /*!< SPI clock prescaler factor is 150 */
#define SPI_PSC_152                     ((uint32_t)0x0000004BU)                 /*!< SPI clock prescaler factor is 152 */
#define SPI_PSC_154                     ((uint32_t)0x0000004CU)                 /*!< SPI clock prescaler factor is 154 */
#define SPI_PSC_156                     ((uint32_t)0x0000004DU)                 /*!< SPI clock prescaler factor is 156 */
#define SPI_PSC_158                     ((uint32_t)0x0000004EU)                 /*!< SPI clock prescaler factor is 158 */
#define SPI_PSC_160                     ((uint32_t)0x0000004FU)                 /*!< SPI clock prescaler factor is 160 */
#define SPI_PSC_162                     ((uint32_t)0x00000050U)                 /*!< SPI clock prescaler factor is 162 */
#define SPI_PSC_164                     ((uint32_t)0x00000051U)                 /*!< SPI clock prescaler factor is 164 */
#define SPI_PSC_166                     ((uint32_t)0x00000052U)                 /*!< SPI clock prescaler factor is 166 */
#define SPI_PSC_168                     ((uint32_t)0x00000053U)                 /*!< SPI clock prescaler factor is 168 */
#define SPI_PSC_170                     ((uint32_t)0x00000054U)                 /*!< SPI clock prescaler factor is 170 */
#define SPI_PSC_172                     ((uint32_t)0x00000055U)                 /*!< SPI clock prescaler factor is 172 */
#define SPI_PSC_174                     ((uint32_t)0x00000056U)                 /*!< SPI clock prescaler factor is 174 */
#define SPI_PSC_176                     ((uint32_t)0x00000057U)                 /*!< SPI clock prescaler factor is 176 */
#define SPI_PSC_178                     ((uint32_t)0x00000058U)                 /*!< SPI clock prescaler factor is 178 */
#define SPI_PSC_180                     ((uint32_t)0x00000059U)                 /*!< SPI clock prescaler factor is 180 */
#define SPI_PSC_182                     ((uint32_t)0x0000005AU)                 /*!< SPI clock prescaler factor is 182 */
#define SPI_PSC_184                     ((uint32_t)0x0000005BU)                 /*!< SPI clock prescaler factor is 184 */
#define SPI_PSC_186                     ((uint32_t)0x0000005CU)                 /*!< SPI clock prescaler factor is 186 */
#define SPI_PSC_188                     ((uint32_t)0x0000005DU)                 /*!< SPI clock prescaler factor is 188 */
#define SPI_PSC_190                     ((uint32_t)0x0000005EU)                 /*!< SPI clock prescaler factor is 190 */
#define SPI_PSC_192                     ((uint32_t)0x0000005FU)                 /*!< SPI clock prescaler factor is 192 */
#define SPI_PSC_194                     ((uint32_t)0x00000060U)                 /*!< SPI clock prescaler factor is 194 */
#define SPI_PSC_196                     ((uint32_t)0x00000061U)                 /*!< SPI clock prescaler factor is 196 */
#define SPI_PSC_198                     ((uint32_t)0x00000062U)                 /*!< SPI clock prescaler factor is 198 */
#define SPI_PSC_200                     ((uint32_t)0x00000063U)                 /*!< SPI clock prescaler factor is 200 */
#define SPI_PSC_202                     ((uint32_t)0x00000064U)                 /*!< SPI clock prescaler factor is 202 */
#define SPI_PSC_204                     ((uint32_t)0x00000065U)                 /*!< SPI clock prescaler factor is 204 */
#define SPI_PSC_206                     ((uint32_t)0x00000066U)                 /*!< SPI clock prescaler factor is 206 */
#define SPI_PSC_208                     ((uint32_t)0x00000067U)                 /*!< SPI clock prescaler factor is 208 */
#define SPI_PSC_210                     ((uint32_t)0x00000068U)                 /*!< SPI clock prescaler factor is 210 */
#define SPI_PSC_212                     ((uint32_t)0x00000069U)                 /*!< SPI clock prescaler factor is 212 */
#define SPI_PSC_214                     ((uint32_t)0x0000006AU)                 /*!< SPI clock prescaler factor is 214 */
#define SPI_PSC_216                     ((uint32_t)0x0000006BU)                 /*!< SPI clock prescaler factor is 216 */
#define SPI_PSC_218                     ((uint32_t)0x0000006CU)                 /*!< SPI clock prescaler factor is 218 */
#define SPI_PSC_220                     ((uint32_t)0x0000006DU)                 /*!< SPI clock prescaler factor is 220 */
#define SPI_PSC_222                     ((uint32_t)0x0000006EU)                 /*!< SPI clock prescaler factor is 222 */
#define SPI_PSC_224                     ((uint32_t)0x0000006FU)                 /*!< SPI clock prescaler factor is 224 */
#define SPI_PSC_226                     ((uint32_t)0x00000070U)                 /*!< SPI clock prescaler factor is 226 */
#define SPI_PSC_228                     ((uint32_t)0x00000071U)                 /*!< SPI clock prescaler factor is 228 */
#define SPI_PSC_230                     ((uint32_t)0x00000072U)                 /*!< SPI clock prescaler factor is 230 */
#define SPI_PSC_232                     ((uint32_t)0x00000073U)                 /*!< SPI clock prescaler factor is 232 */
#define SPI_PSC_234                     ((uint32_t)0x00000074U)                 /*!< SPI clock prescaler factor is 234 */
#define SPI_PSC_236                     ((uint32_t)0x00000075U)                 /*!< SPI clock prescaler factor is 236 */
#define SPI_PSC_238                     ((uint32_t)0x00000076U)                 /*!< SPI clock prescaler factor is 238 */
#define SPI_PSC_240                     ((uint32_t)0x00000077U)                 /*!< SPI clock prescaler factor is 240 */
#define SPI_PSC_242                     ((uint32_t)0x00000078U)                 /*!< SPI clock prescaler factor is 242 */
#define SPI_PSC_244                     ((uint32_t)0x00000079U)                 /*!< SPI clock prescaler factor is 244 */
#define SPI_PSC_246                     ((uint32_t)0x0000007AU)                 /*!< SPI clock prescaler factor is 246 */
#define SPI_PSC_248                     ((uint32_t)0x0000007BU)                 /*!< SPI clock prescaler factor is 248 */
#define SPI_PSC_250                     ((uint32_t)0x0000007CU)                 /*!< SPI clock prescaler factor is 250 */
#define SPI_PSC_252                     ((uint32_t)0x0000007DU)                 /*!< SPI clock prescaler factor is 252 */
#define SPI_PSC_254                     ((uint32_t)0x0000007EU)                 /*!< SPI clock prescaler factor is 254 */
#define SPI_PSC_256                     ((uint32_t)0x0000007FU)                 /*!< SPI clock prescaler factor is 256 */

/* SPI APB bus size */
#define SPI_BUS_SIZE(regval)             (BITS(13,14) & ((uint32_t)(regval) << 13U))
#define SPI_BUS_SIZE_BYTE                 SPI_BUS_SIZE(0)                       /*!< access APB bus size to FIFO is byte */
#define SPI_BUS_SIZE_HALFWORD             SPI_BUS_SIZE(1)                       /*!< access APB bus size to FIFO is half-word */
#define SPI_BUS_SIZE_WORD                 SPI_BUS_SIZE(2)                       /*!< access APB bus size to FIFO is word access */

/* SPI NSS select */
#define SPI_NSS_SELECT(regval)           (BITS(17,19) & ((uint32_t)(regval) << 17U))
#define SPI_NSS_SELECT_0                 SPI_NSS_SELECT(0)                       /*!< SPI NSS select 0 */
#define SPI_NSS_SELECT_1                 SPI_NSS_SELECT(1)                       /*!< SPI NSS select 1 */
#define SPI_NSS_SELECT_2                 SPI_NSS_SELECT(2)                       /*!< SPI NSS select 2 */
#define SPI_NSS_SELECT_3                 SPI_NSS_SELECT(3)                       /*!< SPI NSS select 3 */
#define SPI_NSS_SELECT_4                 SPI_NSS_SELECT(4)                       /*!< SPI NSS select 4 */
#define SPI_NSS_SELECT_5                 SPI_NSS_SELECT(5)                       /*!< SPI NSS select 5 */
#define SPI_NSS_SELECT_6                 SPI_NSS_SELECT(6)                       /*!< SPI NSS select 6 */
#define SPI_NSS_SELECT_7                 SPI_NSS_SELECT(7)                       /*!< SPI NSS select 7 */

