sorosaulong-ux/gd32-test-project/Library/gd32a7xx_spi.h
/* I2S audio sample rate */
#define I2S_AUDIOSAMPLE_8K              ((uint32_t)8000U)                       /*!< I2S audio sample rate is 8KHz */
#define I2S_AUDIOSAMPLE_11K             ((uint32_t)11025U)                      /*!< I2S audio sample rate is 11KHz */
#define I2S_AUDIOSAMPLE_16K             ((uint32_t)16000U)                      /*!< I2S audio sample rate is 16KHz */
#define I2S_AUDIOSAMPLE_22K             ((uint32_t)22050U)                      /*!< I2S audio sample rate is 22KHz */
#define I2S_AUDIOSAMPLE_32K             ((uint32_t)32000U)                      /*!< I2S audio sample rate is 32KHz */
#define I2S_AUDIOSAMPLE_44K             ((uint32_t)44100U)                      /*!< I2S audio sample rate is 44KHz */
#define I2S_AUDIOSAMPLE_48K             ((uint32_t)48000U)                      /*!< I2S audio sample rate is 48KHz */
#define I2S_AUDIOSAMPLE_96K             ((uint32_t)96000U)                      /*!< I2S audio sample rate is 96KHz */
#define I2S_AUDIOSAMPLE_192K            ((uint32_t)192000U)                     /*!< I2S audio sample rate is 192KHz */

/* I2S frame format */
#define I2SCTL_DTLEN(regval)            (BITS(1,2) & ((uint32_t)(regval) << 1U))
#define I2S_FRAMEFORMAT_DT16B_CH16B     I2SCTL_DTLEN(0)                         /*!< I2S data length is 16 bit and channel length is 16 bit */
#define I2S_FRAMEFORMAT_DT16B_CH32B     (I2SCTL_DTLEN(0) | SPI_I2SCTL_CHLEN)    /*!< I2S data length is 16 bit and channel length is 32 bit */
#define I2S_FRAMEFORMAT_DT24B_CH32B     (I2SCTL_DTLEN(1) | SPI_I2SCTL_CHLEN)    /*!< I2S data length is 24 bit and channel length is 32 bit */
#define I2S_FRAMEFORMAT_DT32B_CH32B     (I2SCTL_DTLEN(2) | SPI_I2SCTL_CHLEN)    /*!< I2S data length is 32 bit and channel length is 32 bit */

/* I2S master clock output */
#define I2S_MCKOUT_DISABLE              ((uint32_t)0x00000000U)                 /*!< I2S master clock output disable */
#define I2S_MCKOUT_ENABLE               SPI_I2SPSC_MCKOEN                       /*!< I2S master clock output enable */

/* I2S operation mode */
#define I2SCTL_I2SOPMOD(regval)         (BITS(8,9) & ((uint32_t)(regval) << 8U))
#define I2S_MODE_SLAVETX                I2SCTL_I2SOPMOD(0)                      /*!< I2S slave transmit mode */
#define I2S_MODE_SLAVERX                I2SCTL_I2SOPMOD(1)                      /*!< I2S slave receive mode */
#define I2S_MODE_MASTERTX               I2SCTL_I2SOPMOD(2)                      /*!< I2S master transmit mode */
#define I2S_MODE_MASTERRX               I2SCTL_I2SOPMOD(3)                      /*!< I2S master receive mode */

/* I2S standard */
#define I2SCTL_I2SSTD(regval)           (BITS(4,5) & ((uint32_t)(regval) << 4U))
#define I2S_STD_PHILIPS                 I2SCTL_I2SSTD(0)                        /*!< I2S philips standard */
#define I2S_STD_MSB                     I2SCTL_I2SSTD(1)                        /*!< I2S MSB standard */
#define I2S_STD_LSB                     I2SCTL_I2SSTD(2)                        /*!< I2S LSB standard */
#define I2S_STD_PCMSHORT                I2SCTL_I2SSTD(3)                        /*!< I2S PCM short standard */
#define I2S_STD_PCMLONG                 (I2SCTL_I2SSTD(3) | SPI_I2SCTL_PCMSMOD) /*!< I2S PCM long standard */

/* I2S clock polarity */
#define I2S_CKPL_LOW                    ((uint32_t)0x00000000U)                 /*!< I2S clock polarity low level */
#define I2S_CKPL_HIGH                   SPI_I2SCTL_CKPL                         /*!< I2S clock polarity high level */

/* SPI DMA constants definitions */
#define SPI_DMA_TRANSMIT                ((uint8_t)0x00U)                        /*!< SPI transmit data use DMA */
#define SPI_DMA_RECEIVE                 ((uint8_t)0x01U)                        /*!< SPI receive data use DMA */

/* SPI CRC constants definitions */
#define SPI_CRC_TX                      ((uint8_t)0x00U)                        /*!< SPI transmit CRC value */
#define SPI_CRC_RX                      ((uint8_t)0x01U)                        /*!< SPI receive CRC value */

/* SPI/I2S interrupt enable/disable constants definitions */
#define SPI_I2S_INT_TFA                 SPI_CTL1_TFAIE                          /*!< transmission fifo available interrupt enable */
#define SPI_I2S_INT_RFDR                SPI_CTL1_RFDRIE                         /*!< reception fifo data ready interrupt enable */
#define SPI_I2S_INT_ERR                 SPI_CTL1_ERRIE                          /*!< error interrupt */
#define SPI_INT_TO                      SPI_CTL1_TOIE                           /*!< timeout interrupt */

/* SPI/I2S interrupt flag constants definitions */
#define SPI_I2S_INT_FLAG_TFA            ((uint8_t)0x00U)                        /*!< transmit buffer empty interrupt flag */
#define SPI_I2S_INT_FLAG_RFDR           ((uint8_t)0x01U)                        /*!< receive buffer not empty interrupt flag */
#define SPI_I2S_INT_FLAG_RXORERR        ((uint8_t)0x02U)                        /*!< overrun interrupt flag */
#define SPI_I2S_INT_FLAG_TXURERR        ((uint8_t)0x05U)                        /*!< underrun error interrupt flag */
#define SPI_INT_FLAG_TOF                ((uint8_t)0x04U)                        /*!< timeout interrupt flag */
#define SPI_INT_FLAG_CONFERR            ((uint8_t)0x03U)                        /*!< config error interrupt flag */
#define SPI_I2S_INT_FLAG_FERR           ((uint8_t)0x06U)                        /*!< format error interrupt flag */

/* SPI/I2S flag definitions */
#define SPI_FLAG_RFDR                   SPI_STAT_RFDR                           /*!< reception fifo data ready flag */
#define SPI_FLAG_TFA                    SPI_STAT_TFA                            /*!< transmission fifo available flag */
#define SPI_FLAG_TXURERR                SPI_STAT_TXURERR                        /*!< underrun error flag */
#define SPI_FLAG_CONFERR                SPI_STAT_CONFERR                        /*!< mode config error flag */
#define SPI_FLAG_RXORERR                SPI_STAT_RXORERR                        /*!< receive overrun error flag */
#define SPI_FLAG_TRANS                  SPI_STAT_TRANS                          /*!< transmit on-going flag */
#define SPI_FLAG_FERR                   SPI_STAT_FERR                           /*!< format error flag */
#define SPI_FLAG_TOF                    SPI_STAT_TOF                            /*!< timeout flag */

/* SPI flag definitions */
#define I2S_FLAG_RFDR                   SPI_STAT_RFDR                           /*!< reception fifo data ready flag */
#define I2S_FLAG_TFA                    SPI_STAT_TFA                            /*!< transmission fifo available flag */
#define I2S_FLAG_CH                     SPI_STAT_I2SCH                          /*!< channel side flag */
#define I2S_FLAG_TXURERR                SPI_STAT_TXURERR                        /*!< underrun error flag */
#define I2S_FLAG_RXORERR                SPI_STAT_RXORERR                        /*!< overrun error flag */
#define I2S_FLAG_TRANS                  SPI_STAT_TRANS                          /*!< transmit on-going flag */
#define I2S_FLAG_FERR                   SPI_STAT_FERR                           /*!< format error flag */

/* SPI data size */
#define SPI_DATA_SIZE1                  ((uint8_t)0x07U)                        /*!< data size 8 bit*/
#define SPI_DATA_SIZE2                  ((uint8_t)0x07U)                        /*!< data size 8 bit*/
#define SPI_DATA_SIZE3                  ((uint8_t)0x07U)                        /*!< data size 8 bit*/
#define SPI_DATA_SIZE4                  ((uint8_t)0x03U)                        /*!< data size 4 bit*/
#define SPI_DATA_SIZE5                  ((uint8_t)0x04U)                        /*!< data size 5 bit*/
#define SPI_DATA_SIZE6                  ((uint8_t)0x05U)                        /*!< data size 6 bit*/
#define SPI_DATA_SIZE7                  ((uint8_t)0x06U)                        /*!< data size 7 bit*/
#define SPI_DATA_SIZE8                  ((uint8_t)0x07U)                        /*!< data size 8 bit*/
#define SPI_DATA_SIZE9                  ((uint8_t)0x08U)                        /*!< data size 9 bit*/
#define SPI_DATA_SIZE10                 ((uint8_t)0x09U)                        /*!< data size 10 bit*/
#define SPI_DATA_SIZE11                 ((uint8_t)0x0AU)                        /*!< data size 11 bit*/
#define SPI_DATA_SIZE12                 ((uint8_t)0x0BU)                        /*!< data size 12 bit*/
#define SPI_DATA_SIZE13                 ((uint8_t)0x0CU)                        /*!< data size 13 bit*/
#define SPI_DATA_SIZE14                 ((uint8_t)0x0DU)                        /*!< data size 14 bit*/
#define SPI_DATA_SIZE15                 ((uint8_t)0x0EU)                        /*!< data size 15 bit*/
#define SPI_DATA_SIZE16                 ((uint8_t)0x0FU)                        /*!< data size 16 bit*/
#define SPI_DATA_SIZE17                 ((uint8_t)0x10U)                        /*!< data size 17 bit*/
#define SPI_DATA_SIZE18                 ((uint8_t)0x11U)                        /*!< data size 18 bit*/
#define SPI_DATA_SIZE19                 ((uint8_t)0x12U)                        /*!< data size 19 bit*/
#define SPI_DATA_SIZE20                 ((uint8_t)0x13U)                        /*!< data size 20 bit*/
#define SPI_DATA_SIZE21                 ((uint8_t)0x14U)                        /*!< data size 21 bit*/
#define SPI_DATA_SIZE22                 ((uint8_t)0x15U)                        /*!< data size 22 bit*/
#define SPI_DATA_SIZE23                 ((uint8_t)0x16U)                        /*!< data size 23 bit*/
#define SPI_DATA_SIZE24                 ((uint8_t)0x17U)                        /*!< data size 24 bit*/
#define SPI_DATA_SIZE25                 ((uint8_t)0x18U)                        /*!< data size 25 bit*/
#define SPI_DATA_SIZE26                 ((uint8_t)0x19U)                        /*!< data size 26 bit*/
#define SPI_DATA_SIZE27                 ((uint8_t)0x1AU)                        /*!< data size 27 bit*/
#define SPI_DATA_SIZE28                 ((uint8_t)0x1BU)                        /*!< data size 28 bit*/
#define SPI_DATA_SIZE29                 ((uint8_t)0x1CU)                        /*!< data size 29 bit*/
#define SPI_DATA_SIZE30                 ((uint8_t)0x1DU)                        /*!< data size 30 bit*/
#define SPI_DATA_SIZE31                 ((uint8_t)0x1EU)                        /*!< data size 31 bit*/
#define SPI_DATA_SIZE32                 ((uint8_t)0x1FU)                        /*!< data size 32 bit*/

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* SPI NSS pin definitions */
#define SPI_NSS_PIN_0                   BIT(0)                                  /*!< NSS pin 0 */
#define SPI_NSS_PIN_1                   BIT(1)                                  /*!< NSS pin 1 */
#define SPI_NSS_PIN_2                   BIT(2)                                  /*!< NSS pin 2 */
#define SPI_NSS_PIN_3                   BIT(3)                                  /*!< NSS pin 3 */
#define SPI_NSS_PIN_4                   BIT(4)                                  /*!< NSS pin 4 */
#define SPI_NSS_PIN_5                   BIT(5)                                  /*!< NSS pin 5 */
#define SPI_NSS_PIN_6                   BIT(6)                                  /*!< NSS pin 6 */
#define SPI_NSS_PIN_7                   BIT(7)                                  /*!< NSS pin 7 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

