sorosaulong-ux/gd32-test-project/Library/gd32a7xx_spi.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check SPI peripherals */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_SPI_PERIPH(periph)                               (((periph) != SPI0) && ((periph) != SPI1) && ((periph) != SPI2) && \
                                                              ((periph) != SPI3) && ((periph) != SPI4) && ((periph) != SPI5) && \
                                                              ((periph) != SPI6) && ((periph) != SPI7))
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#ifdef GD32A711X_A712X
#define NOT_SPI_PERIPH(periph)                               (((periph) != SPI0) && ((periph) != SPI1) && ((periph) != SPI2) && \
                                                              ((periph) != SPI3) && ((periph) != SPI4) && ((periph) != SPI5))
#endif /* GD32A711X_A712X */                                       
/* check quad SPI peripherals */
#define NOT_QUAD_SPI_PERIPH(periph)                          (((periph) != SPI0) && ((periph) != SPI2))
/* check I2S peripherals */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_I2S_PERIPH(periph)                               (((periph) != I2S4) && ((periph) != I2S5) && \
                                                              ((periph) != I2S6) && ((periph) != I2S7))
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#ifdef GD32A711X_A712X
#define NOT_I2S_PERIPH(periph)                               (((periph) != I2S4) && ((periph) != I2S5))
#endif /* GD32A711X_A712X */                                       
/* check SPI device mode */
#define NOT_SPI_DEVICE_MODE(device_mode)                     (((device_mode) != SPI_MASTER) && ((device_mode) != SPI_SLAVE))
/* check SPI trans mode */
#define NOT_SPI_TRANS_MODE(trans_mode)                       (((trans_mode) != SPI_TRANSMODE_FULLDUPLEX) && ((trans_mode) != SPI_TRANSMODE_RECEIVEONLY) && \
                                                              ((trans_mode) != SPI_TRANSMODE_BDRECEIVE) && ((trans_mode) != SPI_TRANSMODE_BDTRANSMIT))
/* check SPI nss */
#define NOT_SPI_NSS(nss)                                     (((nss) != SPI_NSS_SOFT) && ((nss) != SPI_NSS_HARD))
/* check SPI nss polarity */
#define NOT_SPI_NSS_POLARITY(nss_polarity)                   (((nss_polarity) != SPI_NSS_POLARITY_LOW) && ((nss_polarity) != SPI_NSS_POLARITY_HIGH))
/* check SPI endian */
#define NOT_SPI_ENDIAN(endian)                               (((endian) != SPI_ENDIAN_MSB) && ((endian) != SPI_ENDIAN_LSB))
/* check SPI clock polarity phase */
#define NOT_SPI_CLOCK_POLARITY_PHASE(clock_polarity_phase)  (((clock_polarity_phase) != SPI_CK_PL_LOW_PH_1EDGE) && ((clock_polarity_phase) != SPI_CK_PL_HIGH_PH_1EDGE) && \
                                                              ((clock_polarity_phase) != SPI_CK_PL_LOW_PH_2EDGE) && ((clock_polarity_phase) != SPI_CK_PL_HIGH_PH_2EDGE))
/* check SPI clock prescaler */
#define NOT_SPI_PRESCALE(prescale)                           ((prescale) > ((uint32_t)0x0000007FU))
/* check SPI i2s mode */
#define NOT_SPI_I2S_MODE(i2s_mode)                           (((i2s_mode) != I2S_MODE_SLAVETX) && ((i2s_mode) != I2S_MODE_SLAVERX) && \
                                                              ((i2s_mode) != I2S_MODE_MASTERTX) && ((i2s_mode) != I2S_MODE_MASTERRX))
/* check SPI i2s standard */
#define NOT_SPI_I2S_STANDARD(i2s_standard)                   (((i2s_standard) != I2S_STD_PHILIPS) && ((i2s_standard) != I2S_STD_MSB) && \
                                                              ((i2s_standard) != I2S_STD_LSB) && ((i2s_standard) != I2S_STD_PCMSHORT) && \
                                                              ((i2s_standard) != I2S_STD_PCMLONG))
/* check SPI i2s ckpl */
#define NOT_SPI_I2S_CKPL(i2s_ckpl)                           (((i2s_ckpl) != I2S_CKPL_LOW) && ((i2s_ckpl) != I2S_CKPL_HIGH))
/* check SPI i2s audiosample */
#define NOT_SPI_I2S_AUDIOSAMPLE(i2s_audiosample)             (((i2s_audiosample) != I2S_AUDIOSAMPLE_8K) && ((i2s_audiosample) != I2S_AUDIOSAMPLE_11K) && \
                                                              ((i2s_audiosample) != I2S_AUDIOSAMPLE_16K) && ((i2s_audiosample) != I2S_AUDIOSAMPLE_22K) && \
                                                              ((i2s_audiosample) != I2S_AUDIOSAMPLE_32K)&& ((i2s_audiosample) != I2S_AUDIOSAMPLE_44K) && \
                                                              ((i2s_audiosample) != I2S_AUDIOSAMPLE_48K)&& ((i2s_audiosample) != I2S_AUDIOSAMPLE_96K) && \
                                                              ((i2s_audiosample) != I2S_AUDIOSAMPLE_192K))
/* check SPI i2s frameformat */
#define NOT_SPI_I2S_FRAMEFORMAT(i2s_frameformat)             (((i2s_frameformat) != I2S_FRAMEFORMAT_DT16B_CH16B) && ((i2s_frameformat) != I2S_FRAMEFORMAT_DT16B_CH32B) && \
                                                              ((i2s_frameformat) != I2S_FRAMEFORMAT_DT24B_CH32B) && ((i2s_frameformat) != I2S_FRAMEFORMAT_DT32B_CH32B))
/* check SPI i2s mckout */
#define NOT_SPI_I2S_MCKOUT(i2s_mckout)                       (((i2s_mckout) != I2S_MCKOUT_ENABLE) && ((i2s_mckout) != I2S_MCKOUT_DISABLE))
/* check SPI nss id */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_SPI_NSS_ID(spi_nss_id)                           ((spi_nss_id) != (SPI_NSS_SELECT_0) && (spi_nss_id) != (SPI_NSS_SELECT_1) && \
                                                              (spi_nss_id) != (SPI_NSS_SELECT_2) && (spi_nss_id) != (SPI_NSS_SELECT_3) && \
                                                              (spi_nss_id) != (SPI_NSS_SELECT_4) && (spi_nss_id) != (SPI_NSS_SELECT_5) && \
                                                              (spi_nss_id) != (SPI_NSS_SELECT_6) && (spi_nss_id) != (SPI_NSS_SELECT_7))
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#ifdef GD32A711X_A712X
#define NOT_SPI_NSS_ID(spi_nss_id)                           ((spi_nss_id) != (SPI_NSS_SELECT_0) && (spi_nss_id) != (SPI_NSS_SELECT_1) && \
                                                              (spi_nss_id) != (SPI_NSS_SELECT_2) && (spi_nss_id) != (SPI_NSS_SELECT_3))
#endif /* GD32A711X_A712X */
/* check SPI dma mode */
#define NOT_SPI_DMA_MODE(spi_dma)                            (((spi_dma) != SPI_DMA_TRANSMIT) && ((spi_dma) != SPI_DMA_RECEIVE))
/* check SPI transfer direction */
#define NOT_SPI_TRANS_DIR(transfer_direction)                (((transfer_direction) != SPI_BIDIRECTIONAL_TRANSMIT) && ((transfer_direction) != SPI_BIDIRECTIONAL_RECEIVE))
/* check SPI/I2S frame format error flag */
#define NOT_SPI_FRAME_FORMAT_ERROR_FLAG(flag)                (((flag) != SPI_FLAG_FERR))
/* check SPI data size */
#define NOT_SPI_DATA_SIZE(size)                              (((size) != SPI_DATA_SIZE4) && ((size) != SPI_DATA_SIZE5) && ((size) != SPI_DATA_SIZE6) && \
                                                              ((size) != SPI_DATA_SIZE7) && ((size) != SPI_DATA_SIZE8) && ((size) != SPI_DATA_SIZE9) && \
                                                              ((size) != SPI_DATA_SIZE10) && ((size) != SPI_DATA_SIZE11) && ((size) != SPI_DATA_SIZE12) && \
                                                              ((size) != SPI_DATA_SIZE13) && ((size) != SPI_DATA_SIZE14) && ((size) != SPI_DATA_SIZE15) && \
                                                              ((size) != SPI_DATA_SIZE16) && ((size) != SPI_DATA_SIZE17) && ((size) != SPI_DATA_SIZE18) && \
                                                              ((size) != SPI_DATA_SIZE19) && ((size) != SPI_DATA_SIZE20) && ((size) != SPI_DATA_SIZE21) && \
                                                              ((size) != SPI_DATA_SIZE22) && ((size) != SPI_DATA_SIZE23) && ((size) != SPI_DATA_SIZE24) && \
                                                              ((size) != SPI_DATA_SIZE25) && ((size) != SPI_DATA_SIZE26) && ((size) != SPI_DATA_SIZE27) && \
                                                              ((size) != SPI_DATA_SIZE28) && ((size) != SPI_DATA_SIZE29) && ((size) != SPI_DATA_SIZE30) && \
                                                              ((size) != SPI_DATA_SIZE31) && ((size) != SPI_DATA_SIZE32))
/* check SPI/I2S flag status */
#define NOT_SPI_I2S_FLAG_STATUS(flag)                        (((flag) != SPI_FLAG_RFDR) && ((flag) != SPI_FLAG_TFA) && \
                                                              ((flag) != SPI_FLAG_TXURERR) && ((flag) != SPI_FLAG_CONFERR) && \
                                                              ((flag) != SPI_FLAG_RXORERR) && ((flag) != SPI_FLAG_TRANS) && \
                                                              ((flag) != SPI_FLAG_FERR) && ((flag) != SPI_FLAG_TOF) && \
                                                              ((flag) != I2S_FLAG_CH))
/* check SPI/I2S interrupt */
#define NOT_SPI_I2S_INTERRUPT(interrupt)                     (((interrupt) != SPI_I2S_INT_TFA) && ((interrupt) != SPI_I2S_INT_RFDR) && \
                                                              ((interrupt) != SPI_I2S_INT_ERR) && ((interrupt) != SPI_INT_TO))
/* check SPI/I2S interrupt flag status */
#define NOT_SPI_I2S_INTERRUPT_FLAG_STATUS(flag)              (((flag) != SPI_I2S_INT_FLAG_TFA) && ((flag) != SPI_I2S_INT_FLAG_RFDR) && \
                                                              ((flag) != SPI_I2S_INT_FLAG_RXORERR) && ((flag) != SPI_I2S_INT_FLAG_TXURERR) && \
                                                              ((flag) != SPI_INT_FLAG_TOF) && ((flag) != SPI_INT_FLAG_CONFERR) && \
                                                              ((flag) != SPI_I2S_INT_FLAG_FERR))
/* check SPI sample delay */
#define NOT_SPI_SAMPLE_DELAY_NUM(delay)                      ((delay) > ((uint16_t)0x0FFFU))
/* check SPI NSS pin */
#define NOT_SPI_NSS_PIN(nss_pin)                             ((nss_pin) > ((uint32_t)0x000000FFU))

#endif

/* function declarations */
/* SPI deinitialization and initialization functions */
/* reset SPI and I2S */
void spi_i2s_deinit(uint32_t spi_periph);
/* initialize the parameters of SPI structure with the default values */
void spi_struct_para_init(spi_parameter_struct *spi_struct);
/* initialize SPI parameters */
void spi_init(uint32_t spi_periph, spi_parameter_struct *spi_struct);
/* enable SPI */
void spi_enable(uint32_t spi_periph);
/* disable SPI */
void spi_disable(uint32_t spi_periph);

/* I2S initialization functions */
/* initialize I2S parameter */
void i2s_init(uint32_t i2s_periph, uint32_t i2s_mode, uint32_t i2s_standard, uint32_t i2s_ckpl);
/* configure I2S prescaler */
void i2s_psc_config(uint32_t i2s_periph, uint32_t i2s_audiosample, uint32_t i2s_frameformat,
                    uint32_t i2s_mckout);
/* enable I2S */
void i2s_enable(uint32_t i2s_periph);
/* disable I2S */
void i2s_disable(uint32_t i2s_periph);

/* NSS functions */
/* enable SPI NSS output */
void spi_nss_output_enable(uint32_t spi_periph);
/* disable SPI NSS output */
void spi_nss_output_disable(uint32_t spi_periph);
/* SPI NSS pin high level in software mode */
void spi_nss_internal_high(uint32_t spi_periph);
/* SPI NSS pin low level in software mode */
void spi_nss_internal_low(uint32_t spi_periph);
/* SPI NSS select */
void spi_nss_select(uint32_t spi_periph, uint32_t spi_nss_id);

/* DMA functions */
/* enable SPI DMA */
void spi_dma_enable(uint32_t spi_periph, uint8_t spi_dma);
/* disable SPI DMA */
void spi_dma_disable(uint32_t spi_periph, uint8_t spi_dma);

/* SPI/I2S transfer functions */
/* SPI transmit data */
void spi_i2s_data_transmit(uint32_t spi_periph, uint32_t data);
/* SPI receive data */
uint32_t spi_i2s_data_receive(uint32_t spi_periph);
/* configure SPI bidirectional transfer direction */
void spi_bidirectional_transfer_config(uint32_t spi_periph, uint32_t transfer_direction);
/* clear TI Mode Format Error flag status */
void spi_i2s_format_error_clear(uint32_t spi_periph, uint32_t flag);

/* SPI data size */
void spi_i2s_data_size(uint32_t spi_periph, uint8_t data_size);
/* SPI fifo loopback mode enable */
void spi_i2s_fifo_loopback_enable(uint32_t spi_periph);
/* SPI fifo loopback mode disable */
void spi_i2s_fifo_loopback_disable(uint32_t spi_periph);

/* RXFIFO current words number */
uint32_t spi_i2s_read_rxlvl_words(uint32_t spi_periph);
/* TXFIFO current words number */
uint32_t spi_i2s_read_txlvl_words(uint32_t spi_periph);

