sorosaulong-ux/gd32-test-project/Library/gd32a7xx_spi.h
/* SPI CRC functions */
/* set SPI CRC polynomial */
void spi_crc_polynomial_set(uint32_t spi_periph, uint32_t crc_poly);
/* get SPI CRC polynomial */
uint32_t spi_crc_polynomial_get(uint32_t spi_periph);
/* turn on SPI CRC function */
void spi_crc_on(uint32_t spi_periph);
/* turn off SPI CRC function */
void spi_crc_off(uint32_t spi_periph);
/* SPI next data is CRC value */
void spi_crc_next(uint32_t spi_periph);
/* get SPI CRC send value */
uint32_t spi_tx_crc_get(uint32_t spi_periph);

/* SPI TI mode functions */
/* enable SPI TI mode */
void spi_ti_mode_enable(uint32_t spi_periph);
/* disable SPI TI mode */
void spi_ti_mode_disable(uint32_t spi_periph);

/* SPI NSS pulse mode functions */
/* enable SPI NSS pulse mode */
void spi_nssp_mode_enable(uint32_t spi_periph);
/* disable SPI NSS pulse mode */
void spi_nssp_mode_disable(uint32_t spi_periph);

/* quad wire SPI functions */
/* enable quad wire SPI */
void spi_quad_enable(uint32_t spi_periph);
/* disable quad wire SPI */
void spi_quad_disable(uint32_t spi_periph);
/* enable quad wire SPI write */
void spi_quad_write_enable(uint32_t spi_periph);
/* enable quad wire SPI read */
void spi_quad_read_enable(uint32_t spi_periph);

/* flag and interrupt functions */
/* get SPI and I2S flag status */
FlagStatus spi_i2s_flag_get(uint32_t spi_periph, uint32_t flag);
/* enable SPI and I2S interrupt */
void spi_i2s_interrupt_enable(uint32_t spi_periph, uint32_t interrupt);
/* disable SPI and I2S interrupt */
void spi_i2s_interrupt_disable(uint32_t spi_periph, uint32_t interrupt);
/* get SPI and I2S interrupt status */
FlagStatus spi_i2s_interrupt_flag_get(uint32_t spi_periph, uint8_t interrupt);

/* SPI host request configuration functions */
/* SPI configure the SPI_HREQ direction is output */
void spi_hr_output(uint32_t spi_periph);
/* SPI configure the SPI_HREQ direction is input */
void spi_hr_input(uint32_t spi_periph);

/* SPI host request input is the SPI_HREQ pin */
void spi_hrsel_pin(uint32_t spi_periph);
/* SPI host request input is the input trigger */
void spi_hrsel_trigger(uint32_t spi_periph);

/* SPI configures the polatity of the host request pin or trigger is active high */
void spi_hr_high(uint32_t spi_periph);
/* SPI configures the polatity of the host request pin or trigger is active loe */
void spi_hr_low(uint32_t spi_periph);

/* SPI configure host request is enabled */
void spi_hr_enable(uint32_t spi_periph);
/* SPI configure host request is disabled */
void spi_hr_disable(uint32_t spi_periph);

/* NSS polarity configuration */
/* Configure NSS polarity as active high */
void spi_nss_polarity_high(uint32_t spi_periph);
/* Configure NSS polarity as active low */
void spi_nss_polarity_low(uint32_t spi_periph);

/* SPI control signal timing configuration */
/* Configure minimum delay from NSS inactive to NSS active */
void spi_nssnss_delay(uint32_t spi_periph, uint8_t delay);
/* Configure minimum delay from SCK inactive to NSS inactive */
void spi_scknss_delay(uint32_t spi_periph, uint8_t delay);
/* Configure minimum delay from NSS active to SCK active */
void spi_nsssck_delay(uint32_t spi_periph, uint8_t delay);

/* SPI sampling delay function */
/* Enable SPI sampling delay */
void spi_sample_delay_enable(uint32_t spi_periph);
/* Disable SPI sampling delay */
void spi_sample_delay_disable(uint32_t spi_periph);
/* Configure SPI sampling delay compensation time */
void spi_sample_delay_config(uint32_t spi_periph, uint16_t delay);

/* SPI bus idle timeout function */
/* Enable SPI bus idle timeout */
void spi_idle_timeout_enable(uint32_t spi_periph);
/* Disable SPI bus idle timeout */
void spi_idle_timeout_disable(uint32_t spi_periph);
/* Configure SPI bus idle timeout threshold */
void spi_idle_threshold_config(uint32_t spi_periph, uint8_t threshold);
/* Clear SPI idle timeout flag */
void spi_timeout_flag_clear(uint32_t spi_periph);
/* Clear SPI idle timeout interrupt flag */
void spi_timeout_interrupt_flag_clear(uint32_t spi_periph);

/* SPI hardware mode configuration */
/* Enable SPI hardware single-frame mode */
void spi_single_frame_enable(uint32_t spi_periph);
/* Disable SPI hardware single-frame mode */
void spi_single_frame_disable(uint32_t spi_periph);
/* Enable SPI hardware continuous-frame mode */
void spi_continuous_frame_enable(uint32_t spi_periph);
/* Disable SPI hardware continuous-frame mode */
void spi_continuous_frame_disable(uint32_t spi_periph);
/* Configure SPI hardware continuous-frame length */
void spi_continuous_frame_length_config(uint32_t spi_periph, uint16_t length);

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* NSS pin polarity independent configuration function */
/* Configure multiple NSS pins polarity as active high */
void spi_multi_nss_polarity_high(uint32_t spi_periph, uint32_t nss_pin);
/* Configure multiple NSS pins polarity as active low */
void spi_multi_nss_polarity_low(uint32_t spi_periph, uint32_t nss_pin);
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#endif /* GD32A7XX_SPI_H */
